xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
        // 显示z角度值
        label_z = lv_label_create(icon_in_obj);
        lv_label_set_text(label_z, "Z:");
        lv_obj_set_style_text_color(label_z, lv_color_hex(0x000000), 0);
        lv_obj_set_style_text_font(label_z, &lv_font_montserrat_20, 0);
        lv_obj_align(label_z, LV_ALIGN_TOP_LEFT, 20, 180);
        // 显示z角度bar
        z_bar = lv_bar_create(icon_in_obj);
        lv_obj_set_size(z_bar, 200, 25);
        lv_obj_align(z_bar, LV_ALIGN_TOP_LEFT, 80, 180);
        lv_bar_set_mode(z_bar, LV_BAR_MODE_RANGE);
        lv_bar_set_range(z_bar, -101, 101);
        lv_bar_set_start_value(z_bar, -10, LV_ANIM_OFF);
        lv_bar_set_value(z_bar, 10, LV_ANIM_OFF);

        // 创建一个lv_timer 用于更新角度
        my_lv_timer = lv_timer_create(att_update_cb, 200, NULL);
        lvgl_port_unlock();
    }

    vTaskDelete(NULL);
}

static void att_event_handler(lv_event_t * e)
{
    if (icon_flag != 0) {
        return;
    }

    // 创建一个界面
    static lv_style_t style;
    static bool style_ready;
    if (!style_ready) {
        lv_style_init(&style);
        lv_style_set_radius(&style, 10);
        lv_style_set_bg_opa( &style, LV_OPA_COVER );
        lv_style_set_bg_color(&style, lv_color_hex(0xffffff));
        lv_style_set_border_width(&style, 0);
        lv_style_set_pad_all(&style, 0);
        lv_style_set_width(&style, 320);
        lv_style_set_height(&style, 240);
        style_ready = true;
    }

    icon_in_obj = lv_obj_create(lv_scr_act());
    lv_obj_add_style(icon_in_obj, &style, 0);

    // 创建标题背景
    lv_obj_t *att_title = lv_obj_create(icon_in_obj);
    lv_obj_set_size(att_title, 320, 40);
    lv_obj_set_style_pad_all(att_title, 0, 0);  // 设置间隙
    lv_obj_align(att_title, LV_ALIGN_TOP_LEFT, 0, 0);
    lv_obj_set_style_bg_color(att_title, lv_color_hex(0x30a830), 0);
    // 显示标题
    att_label = lv_label_create(att_title);
    lv_label_set_text(att_label, "运动监测");
    lv_obj_set_style_text_color(att_label, lv_color_hex(0xffffff), 0); 
    lv_obj_set_style_text_font(att_label, &font_alipuhui20, 0);
    lv_obj_align(att_label, LV_ALIGN_CENTER, 0, 0);
    // 创建后退按钮
    btn_att_back = lv_btn_create(att_title);
    lv_obj_align(btn_att_back, LV_ALIGN_LEFT_MID, 0, 0);
    lv_obj_set_size(btn_att_back, 60, 30);
    lv_obj_set_style_border_width(btn_att_back, 0, 0); // 设置边框宽度
    lv_obj_set_style_pad_all(btn_att_back, 0, 0);  // 设置间隙
    lv_obj_set_style_bg_opa(btn_att_back, LV_OPA_TRANSP, LV_PART_MAIN); // 背景透明
    lv_obj_set_style_shadow_opa(btn_att_back, LV_OPA_TRANSP, LV_PART_MAIN); // 阴影透明
    lv_obj_add_event_cb(btn_att_back, btn_att_back_cb, LV_EVENT_CLICKED, NULL); // 添加按键处理函数

    lv_obj_t *label_back = lv_label_create(btn_att_back); 
    lv_label_set_text(label_back, LV_SYMBOL_LEFT);  // 按键上显示左箭头符号
    lv_obj_set_style_text_font(label_back, &lv_font_montserrat_20, 0);
    lv_obj_set_style_text_color(label_back, lv_color_hex(0xffffff), 0); 
    lv_obj_align(label_back, LV_ALIGN_CENTER, -10, 0);

    icon_flag = 1; // 标记已经进入第一个应用
    BaseType_t ok = xTaskCreatePinnedToCore(task_process_att, "task_process_att", 4 * 1024, NULL, 5, NULL, 1);
    if (ok != pdPASS) {
        lv_label_set_text(att_label, "任务创建失败");
    }
}


/*********************  第2个图标   音乐播放器 *********************************************************************************************/
static audio_player_config_t player_config = {0};
static uint8_t g_sys_volume = VOLUME_DEFAULT;
static file_iterator_instance_t *file_iterator = NULL;
static bool g_audio_player_ready;
static bool g_audio_list_mode = true;

lv_obj_t *music_list;
lv_obj_t *label_play_pause;
lv_obj_t *btn_play_pause;
lv_obj_t *volume_slider;

lv_obj_t *music_title_label;
lv_obj_t *btn_music_back;

#define MUSIC_DIR_PRIMARY SD_MOUNT_POINT "/szpi/music"
#define MUSIC_DIR_ALT     SD_MOUNT_POINT "/music"

static void music_dropdown_apply_font(lv_obj_t *dropdown)
{
    lv_obj_set_style_text_font(dropdown, &font_alipuhui20, LV_PART_MAIN);
    lv_obj_t *list = lv_dropdown_get_list(dropdown);
    if (list != NULL) {
        lv_obj_set_style_text_font(list, &font_alipuhui20, LV_PART_MAIN);
        lv_obj_set_style_text_font(list, &font_alipuhui20, LV_PART_SELECTED);
    }
}

static void music_dropdown_style_cb(lv_event_t *event)
{
    lv_event_code_t code = lv_event_get_code(event);
    if (code == LV_EVENT_PRESSED ||
        code == LV_EVENT_CLICKED ||
        code == LV_EVENT_READY ||
        code == LV_EVENT_VALUE_CHANGED) {
        music_dropdown_apply_font(lv_event_get_target(event));
    }
}

static bool music_name_is_audio(const char *name)
{
    if (name == NULL || name[0] == '.') {
        return false;
    }

    const char *ext = strrchr(name, '.');
    return ext != NULL && (strcasecmp(ext, ".mp3") == 0 || strcasecmp(ext, ".wav") == 0);
}

static void music_iterator_free(file_iterator_instance_t *iter)
{
    if (iter == NULL) {
        return;
    }

    if (iter->list != NULL) {
        for (size_t i = 0; i < iter->count; i++) {
            free(iter->list[i]);
        }
        free(iter->list);
    }
    free((void *)iter->directory_path);
    free(iter);
}

static file_iterator_instance_t *music_iterator_new_from_dir(const char *dir_path)
{
    DIR *dir = opendir(dir_path);
    if (dir == NULL) {
        return NULL;
    }

    size_t count = 0;
    struct dirent *entry = NULL;
    while ((entry = readdir(dir)) != NULL) {
        if (music_name_is_audio(entry->d_name)) {
            count++;
        }
    }

    if (count == 0) {
        closedir(dir);
        return NULL;
    }

    file_iterator_instance_t *iter = calloc(1, sizeof(*iter));
    if (iter == NULL) {
        closedir(dir);
        return NULL;
    }

    iter->list = calloc(count, sizeof(char *));
    iter->directory_path = strdup(dir_path);
    if (iter->list == NULL || iter->directory_path == NULL) {
        closedir(dir);
        music_iterator_free(iter);
        return NULL;
    }

    rewinddir(dir);
    while ((entry = readdir(dir)) != NULL && iter->count < count) {
        if (!music_name_is_audio(entry->d_name)) {
            continue;
        }

        iter->list[iter->count] = strdup(entry->d_name);
        if (iter->list[iter->count] == NULL) {
            closedir(dir);
            music_iterator_free(iter);
            return NULL;
        }
        iter->count++;
    }
    closedir(dir);

    return iter;
}

static file_iterator_instance_t *music_iterator_new_from_sd(void)
{
    const char *dirs[] = {
        MUSIC_DIR_PRIMARY,
        MUSIC_DIR_ALT,
        SD_MOUNT_POINT,
    };

    if (bsp_sdcard_mount() != ESP_OK) {
        ESP_LOGW(TAG, "SD card not ready for music");
        return NULL;
    }

