xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
    lv_obj_t *label_back = lv_label_create(btn_music_back); 
    lv_label_set_text(label_back, LV_SYMBOL_LEFT);  // 按键上显示左箭头符号
    lv_obj_set_style_text_font(label_back, &lv_font_montserrat_20, 0);
    lv_obj_set_style_text_color(label_back, lv_color_hex(0xffffff), 0); 
    lv_obj_align(label_back, LV_ALIGN_CENTER, -10, 0);

    icon_flag = 2; // 标记已经进入第二个应用

    music_ui(); // 音乐播放器界面
}


/******************************** 第3个图标 SD卡 应用程序***************************************************************************/
lv_obj_t * sdcard_title; // SD卡页面标题背景
lv_obj_t * sdcard_label; // SD卡页面标题
lv_obj_t * sdcard_file_list; // SD卡文件列表
lv_obj_t * sdcard_preview_page; // 文件预览页面
static lv_obj_t *s_sdmgr_status_label;
static lv_obj_t *s_sdmgr_info_label;

#define SDCARD_PREVIEW_TOP 40
#define SDCARD_PREVIEW_W BSP_LCD_H_RES
#define SDCARD_PREVIEW_H (BSP_LCD_V_RES - SDCARD_PREVIEW_TOP)
#define SDCARD_TEXT_PREVIEW_LIMIT 4096
#define SDCARD_IMAGE_PREVIEW_LIMIT (2 * 1024 * 1024)
#define SDCARD_PNG_PREVIEW_LIMIT (768 * 1024)
#define SDCARD_GIF_PREVIEW_LIMIT (512 * 1024)
#define SDCARD_TEXT_PREVIEW_EXTRA 96

extern sdmmc_card_t *sdmmc_card;

struct file_path_info
{
    uint8_t path_index;  // 在第几级目录
    char path_now[512]; // 当前文件路径
    char path_back[512]; // 上级文件路径
};
struct file_path_info file_path_info;

typedef enum {
    SD_FILE_OTHER = 0,
    SD_FILE_AUDIO,
    SD_FILE_VIDEO,
    SD_FILE_IMAGE_JPEG,
    SD_FILE_IMAGE_PNG,
    SD_FILE_IMAGE_GIF,
    SD_FILE_TEXT,
} sd_file_type_t;

static uint8_t *s_preview_img_buf;
static lv_img_dsc_t s_preview_img_dsc;
static bool s_lv_fs_ready;
static volatile uint32_t s_sd_preview_generation;
static bsp_sdcard_format_t s_sd_format_target = BSP_SDCARD_FORMAT_AUTO;
static bool s_sd_format_confirm;
static TaskHandle_t s_sd_format_task_handle;
static TaskHandle_t s_sd_manager_task_handle;
static lv_obj_t *s_sd_fs_button_label;
static lv_obj_t *s_sd_fmt_button_label;

typedef struct {
    char path[512];
    uint32_t generation;
} sd_jpeg_preview_req_t;

// 函数声明
esp_err_t list_sdcard_files(char * path);
static void file_list_btn_cb(lv_event_t * e); 
static void sd_preview_message(const char *title, const char *message);

static const char *sd_format_name(bsp_sdcard_format_t format)
{
    switch (format) {
    case BSP_SDCARD_FORMAT_FAT32:
        return "FAT32";
    case BSP_SDCARD_FORMAT_EXFAT:
        return "exFAT";
    case BSP_SDCARD_FORMAT_AUTO:
    default:
        return "Auto";
    }
}

static void sd_update_format_labels(void)
{
    if (s_sd_fs_button_label != NULL) {
        lv_label_set_text_fmt(s_sd_fs_button_label, "FS:%s", sd_format_name(s_sd_format_target));
    }
    if (s_sd_fmt_button_label != NULL) {
        lv_label_set_text(s_sd_fmt_button_label, s_sd_format_confirm ? "OK?" : "FMT");
    }
}

static const char *sd_file_ext(const char *path)
{
    const char *dot = strrchr(path, '.');
    return (dot != NULL && dot[1] != '\0') ? dot + 1 : "";
}

static bool sd_ext_is(const char *ext, const char *want)
{
    return strcasecmp(ext, want) == 0;
}

static sd_file_type_t sd_classify_file(const char *path)
{
    const char *ext = sd_file_ext(path);
    if (sd_ext_is(ext, "mp3") || sd_ext_is(ext, "wav")) {
        return SD_FILE_AUDIO;
    }
    if (sd_ext_is(ext, "mp4") || sd_ext_is(ext, "avi")) {
        return SD_FILE_VIDEO;
    }
    if (sd_ext_is(ext, "jpg") || sd_ext_is(ext, "jpeg")) {
        return SD_FILE_IMAGE_JPEG;
    }
    if (sd_ext_is(ext, "png")) {
        return SD_FILE_IMAGE_PNG;
    }
    if (sd_ext_is(ext, "gif")) {
        return SD_FILE_IMAGE_GIF;
    }
    if (sd_ext_is(ext, "txt") || sd_ext_is(ext, "log") || sd_ext_is(ext, "ini") ||
        sd_ext_is(ext, "json") || sd_ext_is(ext, "md") || sd_ext_is(ext, "csv")) {
        return SD_FILE_TEXT;
    }
    return SD_FILE_OTHER;
}

static void sd_format_file_size(char *out, size_t out_len, off_t size)
{
    if (size < 0) {
        snprintf(out, out_len, "未知");
        return;
    }
    if (size < 1024) {
        snprintf(out, out_len, "%ld B", (long)size);
        return;
    }
    if (size < 1024 * 1024) {
        snprintf(out, out_len, "%.1f KB", (double)size / 1024.0);
        return;
    }
    snprintf(out, out_len, "%.1f MB", (double)size / (1024.0 * 1024.0));
}

static void sd_format_bytes_u64(char *out, size_t out_len, uint64_t bytes)
{
    if (bytes < 1024ULL) {
        snprintf(out, out_len, "%llu B", (unsigned long long)bytes);
    } else if (bytes < 1024ULL * 1024ULL) {
        snprintf(out, out_len, "%.1f KB", (double)bytes / 1024.0);
    } else if (bytes < 1024ULL * 1024ULL * 1024ULL) {
        snprintf(out, out_len, "%.1f MB", (double)bytes / (1024.0 * 1024.0));
    } else {
        snprintf(out, out_len, "%.1f GB", (double)bytes / (1024.0 * 1024.0 * 1024.0));
    }
}

static const char *sd_partition_table_name(bsp_sdcard_table_t table_type)
{
    switch (table_type) {
    case BSP_SDCARD_TABLE_NONE:
        return "No PT";
    case BSP_SDCARD_TABLE_MBR:
        return "MBR";
    case BSP_SDCARD_TABLE_GPT:
        return "GPT";
    case BSP_SDCARD_TABLE_UNKNOWN:
    default:
        return "Unknown";
    }
}

static void sd_preview_large_file(const char *title, off_t file_size, size_t limit)
{
    char file_size_text[24];
    char limit_text[24];
    char message[192];

    sd_format_file_size(file_size_text, sizeof(file_size_text), file_size);
    sd_format_file_size(limit_text, sizeof(limit_text), (off_t)limit);
    snprintf(message, sizeof(message),
             "文件较大，已跳过自动预览\n大小: %s\n安全上限: %s\n\n请压缩或裁切后再预览",
             file_size_text, limit_text);
    sd_preview_message(title, message);
}

static void *sd_lv_fs_open(lv_fs_drv_t *drv, const char *path, lv_fs_mode_t mode)
{
    LV_UNUSED(drv);
    const char *flags = NULL;
    if (mode == LV_FS_MODE_WR) {
        flags = "wb";
    } else if (mode == LV_FS_MODE_RD) {
        flags = "rb";
    } else if (mode == (LV_FS_MODE_WR | LV_FS_MODE_RD)) {
        flags = "rb+";
    }
    return flags == NULL ? NULL : fopen(path, flags);
}

static lv_fs_res_t sd_lv_fs_close(lv_fs_drv_t *drv, void *file_p)
{
    LV_UNUSED(drv);
    fclose((FILE *)file_p);
    return LV_FS_RES_OK;
}

static lv_fs_res_t sd_lv_fs_read(lv_fs_drv_t *drv, void *file_p, void *buf, uint32_t btr, uint32_t *br)
{
    LV_UNUSED(drv);
    *br = fread(buf, 1, btr, (FILE *)file_p);
    return LV_FS_RES_OK;
}

