xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
static lv_fs_res_t sd_lv_fs_seek(lv_fs_drv_t *drv, void *file_p, uint32_t pos, lv_fs_whence_t whence)
{
    LV_UNUSED(drv);
    return fseek((FILE *)file_p, pos, whence) == 0 ? LV_FS_RES_OK : LV_FS_RES_UNKNOWN;
}

static lv_fs_res_t sd_lv_fs_tell(lv_fs_drv_t *drv, void *file_p, uint32_t *pos_p)
{
    LV_UNUSED(drv);
    long pos = ftell((FILE *)file_p);
    if (pos < 0) {
        return LV_FS_RES_UNKNOWN;
    }
    *pos_p = (uint32_t)pos;
    return LV_FS_RES_OK;
}

static void sd_lv_fs_init_once(void)
{
    if (s_lv_fs_ready) {
        return;
    }

    static lv_fs_drv_t fs_drv;
    lv_fs_drv_init(&fs_drv);
    fs_drv.letter = 'S';
    fs_drv.open_cb = sd_lv_fs_open;
    fs_drv.close_cb = sd_lv_fs_close;
    fs_drv.read_cb = sd_lv_fs_read;
    fs_drv.seek_cb = sd_lv_fs_seek;
    fs_drv.tell_cb = sd_lv_fs_tell;
    lv_fs_drv_register(&fs_drv);
    s_lv_fs_ready = true;
}

static bool sd_audio_player_ready(void)
{
    if (g_audio_player_ready) {
        return true;
    }

    player_config.mute_fn = _audio_player_mute_fn;
    player_config.write_fn = _audio_player_write_fn;
    player_config.clk_set_fn = _audio_player_std_clock;
    player_config.priority = 6;
    player_config.coreID = 1;

    if (audio_player_new(player_config) != ESP_OK) {
        return false;
    }
    if (audio_player_callback_register(_audio_player_callback, NULL) != ESP_OK) {
        audio_player_delete();
        return false;
    }
    g_audio_player_ready = true;
    return true;
}

static void sd_preview_clear_current(void)
{
    if (g_audio_player_ready && !g_audio_list_mode) {
        audio_player_stop();
    }
    if (sdcard_preview_page != NULL) {
        lv_obj_del(sdcard_preview_page);
        sdcard_preview_page = NULL;
    }
    if (s_preview_img_buf != NULL) {
        heap_caps_free(s_preview_img_buf);
        s_preview_img_buf = NULL;
    }
}

static void sd_preview_cleanup(void)
{
    s_sd_preview_generation++;
    sd_preview_clear_current();
}

static void sd_preview_back_cb(lv_event_t *e)
{
    sd_preview_cleanup();
}

static lv_obj_t *sd_preview_create_page(const char *title)
{
    sd_preview_clear_current();

    sdcard_preview_page = lv_obj_create(lv_scr_act());
    lv_obj_set_size(sdcard_preview_page, 320, 240);
    lv_obj_set_style_pad_all(sdcard_preview_page, 0, 0);
    lv_obj_set_style_border_width(sdcard_preview_page, 0, 0);
    lv_obj_set_style_radius(sdcard_preview_page, 0, 0);
    lv_obj_set_style_bg_color(sdcard_preview_page, lv_color_hex(0x101820), 0);

    lv_obj_t *bar = lv_obj_create(sdcard_preview_page);
    lv_obj_set_size(bar, 320, SDCARD_PREVIEW_TOP);
    lv_obj_align(bar, LV_ALIGN_TOP_LEFT, 0, 0);
    lv_obj_set_style_pad_all(bar, 0, 0);
    lv_obj_set_style_border_width(bar, 0, 0);
    lv_obj_set_style_radius(bar, 0, 0);
    lv_obj_set_style_bg_color(bar, lv_color_hex(0x008b8b), 0);

    lv_obj_t *back = lv_btn_create(bar);
    lv_obj_set_size(back, 56, 34);
    lv_obj_align(back, LV_ALIGN_LEFT_MID, 2, 0);
    lv_obj_set_style_bg_opa(back, LV_OPA_TRANSP, 0);
    lv_obj_set_style_shadow_opa(back, LV_OPA_TRANSP, 0);
    lv_obj_add_event_cb(back, sd_preview_back_cb, LV_EVENT_CLICKED, NULL);

    lv_obj_t *back_label = lv_label_create(back);
    lv_label_set_text(back_label, LV_SYMBOL_LEFT);
    lv_obj_set_style_text_font(back_label, &lv_font_montserrat_20, 0);
    lv_obj_set_style_text_color(back_label, lv_color_hex(0xffffff), 0);
    lv_obj_center(back_label);

    lv_obj_t *title_label = lv_label_create(bar);
    lv_label_set_text(title_label, title);
    lv_obj_set_style_text_font(title_label, &font_alipuhui20, 0);
    lv_obj_set_style_text_color(title_label, lv_color_hex(0xffffff), 0);
    lv_obj_set_width(title_label, 210);
    lv_label_set_long_mode(title_label, LV_LABEL_LONG_SCROLL_CIRCULAR);
    lv_obj_align(title_label, LV_ALIGN_CENTER, 8, 0);

    lv_obj_t *body = lv_obj_create(sdcard_preview_page);
    lv_obj_set_size(body, 320, SDCARD_PREVIEW_H);
    lv_obj_align(body, LV_ALIGN_BOTTOM_LEFT, 0, 0);
    lv_obj_set_style_pad_all(body, 0, 0);
    lv_obj_set_style_border_width(body, 0, 0);
    lv_obj_set_style_radius(body, 0, 0);
    lv_obj_set_style_bg_color(body, lv_color_hex(0x101820), 0);
    return body;
}

static void sd_preview_message(const char *title, const char *message)
{
    lvgl_port_lock(0);
    lv_obj_t *body = sd_preview_create_page(title);
    lv_obj_t *label = lv_label_create(body);
    lv_label_set_text(label, message);
    lv_label_set_long_mode(label, LV_LABEL_LONG_WRAP);
    lv_obj_set_style_text_font(label, &font_alipuhui20, 0);
    lv_obj_set_style_text_align(label, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_set_style_text_color(label, lv_color_hex(0xffffff), 0);
    lv_obj_set_width(label, 280);
    lv_obj_align(label, LV_ALIGN_CENTER, 0, 0);
    lvgl_port_unlock();
}

static void sd_preview_text(const char *path, off_t file_size)
{
    FILE *f = fopen(path, "rb");
    if (f == NULL) {
        sd_preview_message("文本预览", "文件打开失败");
        return;
    }

    char *buf = heap_caps_malloc(SDCARD_TEXT_PREVIEW_LIMIT + SDCARD_TEXT_PREVIEW_EXTRA,
                                 MALLOC_CAP_8BIT | MALLOC_CAP_SPIRAM);
    if (buf == NULL) {
        fclose(f);
        sd_preview_message("文本预览", "内存不足");
        return;
    }

    size_t len = fread(buf, 1, SDCARD_TEXT_PREVIEW_LIMIT, f);
    bool truncated = !feof(f);
    fclose(f);
    buf[len] = '\0';
    if (truncated || file_size > (off_t)SDCARD_TEXT_PREVIEW_LIMIT) {
        snprintf(buf + len, SDCARD_TEXT_PREVIEW_EXTRA, "\n\n...仅显示前 %u KB",
                 (unsigned)(SDCARD_TEXT_PREVIEW_LIMIT / 1024));
    }

    lvgl_port_lock(0);
    lv_obj_t *body = sd_preview_create_page("文本预览");
    lv_obj_t *ta = lv_textarea_create(body);
    lv_obj_set_size(ta, 312, 192);
    lv_obj_align(ta, LV_ALIGN_CENTER, 0, 0);
    lv_textarea_set_text(ta, buf);
    lv_textarea_set_cursor_click_pos(ta, false);
    lv_obj_set_style_text_font(ta, &font_alipuhui20, 0);
    lvgl_port_unlock();

    heap_caps_free(buf);
}

static void sd_build_lv_path(const char *path, char *out, size_t out_len)
{
    snprintf(out, out_len, "S:%s", path);
}

static void sd_preview_png(const char *path)
{
    sd_lv_fs_init_once();
    char lv_path[540];
    sd_build_lv_path(path, lv_path, sizeof(lv_path));

    lvgl_port_lock(0);
    lv_obj_t *body = sd_preview_create_page("PNG预览");
    lv_obj_set_scrollbar_mode(body, LV_SCROLLBAR_MODE_AUTO);
    lv_obj_t *img = lv_img_create(body);
    lv_img_set_src(img, lv_path);
    lv_obj_center(img);
    lvgl_port_unlock();
}

static void sd_preview_gif(const char *path)
{
    sd_lv_fs_init_once();
    char lv_path[540];
    sd_build_lv_path(path, lv_path, sizeof(lv_path));

    lvgl_port_lock(0);
    lv_obj_t *body = sd_preview_create_page("GIF动图");
    lv_obj_set_scrollbar_mode(body, LV_SCROLLBAR_MODE_AUTO);
    lv_obj_t *gif = lv_gif_create(body);
    lv_gif_set_src(gif, lv_path);
    lv_obj_center(gif);
    lvgl_port_unlock();
}

