xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
    lv_obj_t *title_label = lv_label_create(title);
    lv_label_set_text(title_label, "TF管理");
    lv_obj_set_style_text_font(title_label, &font_alipuhui20, 0);
    lv_obj_set_style_text_color(title_label, lv_color_hex(0xffffff), 0);
    lv_obj_center(title_label);

    s_sdmgr_status_label = lv_label_create(icon_in_obj);
    lv_label_set_text(s_sdmgr_status_label, "扫描中...");
    lv_obj_set_style_text_font(s_sdmgr_status_label, &font_alipuhui20, 0);
    lv_obj_set_style_text_color(s_sdmgr_status_label, lv_color_hex(0xd9f4f6), 0);
    lv_obj_set_width(s_sdmgr_status_label, 300);
    lv_label_set_long_mode(s_sdmgr_status_label, LV_LABEL_LONG_DOT);
    lv_obj_align(s_sdmgr_status_label, LV_ALIGN_TOP_MID, 0, 44);

    lv_obj_t *info_panel = lv_obj_create(icon_in_obj);
    lv_obj_set_size(info_panel, 304, 124);
    lv_obj_align(info_panel, LV_ALIGN_TOP_LEFT, 8, 70);
    lv_obj_set_style_radius(info_panel, 6, 0);
    lv_obj_set_style_border_width(info_panel, 0, 0);
    lv_obj_set_style_bg_color(info_panel, lv_color_hex(0x172331), 0);
    lv_obj_set_style_pad_all(info_panel, 6, 0);
    lv_obj_set_scrollbar_mode(info_panel, LV_SCROLLBAR_MODE_AUTO);

    s_sdmgr_info_label = lv_label_create(info_panel);
    lv_label_set_text(s_sdmgr_info_label, "读取中...");
    lv_label_set_long_mode(s_sdmgr_info_label, LV_LABEL_LONG_WRAP);
    lv_obj_set_width(s_sdmgr_info_label, 288);
    lv_obj_set_style_text_font(s_sdmgr_info_label, &font_alipuhui20, 0);
    lv_obj_set_style_text_color(s_sdmgr_info_label, lv_color_hex(0xffffff), 0);
    lv_obj_align(s_sdmgr_info_label, LV_ALIGN_TOP_LEFT, 0, 0);

    sdmgr_create_button(icon_in_obj, "REF", 6, 202, 48, lv_color_hex(0x287b8f), sdmgr_refresh_cb);
    s_sd_fs_button_label = sdmgr_create_button(icon_in_obj, "FS", 60, 202, 82, lv_color_hex(0x365b80), sd_format_cycle_cb);
    sdmgr_create_button(icon_in_obj, "DIR", 148, 202, 82, lv_color_hex(0x2f7a55), sdmgr_prepare_cb);
    s_sd_fmt_button_label = sdmgr_create_button(icon_in_obj, "FMT", 236, 202, 78, lv_color_hex(0x9b2c2c), sd_format_confirm_cb);
    sd_update_format_labels();

    icon_flag = 9;
    sdmgr_start_refresh();
}



/******************************** 第4个图标 摄像头 应用程序 *****************************************************************************/
lv_obj_t * img_camera;
lv_obj_t * camera_status_label;
static uint8_t *s_camera_display_buf;
static volatile bool s_camera_save_requested;
static TaskHandle_t s_camera_task_handle;
static lv_obj_t *s_camera_page;
static volatile bool s_camera_running;

// 摄像头图像
lv_img_dsc_t img_camera_dsc = {
  .header.cf = LV_IMG_CF_TRUE_COLOR,
  .header.always_zero = 0,
  .header.reserved = 0,
  .header.w = 320,
  .header.h = 240,
  .data_size = 240*320*2,
};

static void camera_set_status(const char *text)
{
    lvgl_port_lock(0);
    if (camera_status_label != NULL) {
        lv_label_set_text(camera_status_label, text);
    }
    lvgl_port_unlock();
}

static void camera_save_frame(camera_fb_t *frame)
{
    camera_set_status("保存中...");

    if (bsp_sdcard_mount() != ESP_OK) {
        camera_set_status("TF卡不可用");
        return;
    }

    mkdir(SD_MOUNT_POINT "/szpi", 0775);
    mkdir(SD_MOUNT_POINT "/szpi/photos", 0775);

    uint8_t *jpg_buf = NULL;
    size_t jpg_len = 0;
    bool ok = frame2jpg(frame, 80, &jpg_buf, &jpg_len);
    if (!ok || jpg_buf == NULL || jpg_len == 0) {
        camera_set_status("编码失败");
        return;
    }

    char path[128];
    snprintf(path, sizeof(path), SD_MOUNT_POINT "/szpi/photos/photo_%lld.jpg", esp_timer_get_time() / 1000);
    FILE *f = fopen(path, "wb");
    if (f == NULL) {
        free(jpg_buf);
        camera_set_status("保存失败");
        return;
    }

    size_t written = fwrite(jpg_buf, 1, jpg_len, f);
    fclose(f);
    free(jpg_buf);
    camera_set_status(written == jpg_len ? "已保存到TF卡" : "写入失败");
}

// 摄像头处理任务
static void task_process_camera(void *arg)
{
    lv_obj_t *page = (lv_obj_t *)arg;
    bool camera_started = false;
    const size_t frame_bytes = 240 * 320 * 2;
    if (s_camera_display_buf == NULL) {
        s_camera_display_buf = heap_caps_malloc(frame_bytes, MALLOC_CAP_8BIT | MALLOC_CAP_SPIRAM);
    }
    if (s_camera_display_buf == NULL) {
        camera_set_status("显示缓冲不足");
        icon_flag = 0;
        goto cleanup;
    }

    memset(s_camera_display_buf, 0xff, frame_bytes);
    img_camera_dsc.data = s_camera_display_buf;
    lvgl_port_lock(0);
    if (img_camera != NULL) {
        lv_img_set_src(img_camera, &img_camera_dsc);
    }
    lvgl_port_unlock();

    camera_set_status("摄像头启动中...");
    esp_err_t ret = bsp_camera_init();
    if (ret != ESP_OK) {
        char msg[48];
        snprintf(msg, sizeof(msg), "摄像头失败:%s", esp_err_to_name(ret));
        camera_set_status(msg);
        vTaskDelay(pdMS_TO_TICKS(1200));
        icon_flag = 0;
        goto cleanup;
    }

    camera_started = true;
    camera_set_status("Ready");
    int null_frame_count = 0;

    while (icon_flag == 4)
    {
        camera_fb_t *frame = esp_camera_fb_get();
        if (frame == NULL) {
            if (s_camera_save_requested && null_frame_count == 0) {
                camera_set_status("等待画面...");
            }
            null_frame_count++;
            if (null_frame_count > 80) {
                camera_set_status("摄像头无画面");
                null_frame_count = 0;
            }
            vTaskDelay(pdMS_TO_TICKS(30));
            continue;
        }
        null_frame_count = 0;

        if (s_camera_save_requested) {
            s_camera_save_requested = false;
            camera_save_frame(frame);
        }

        size_t copy_len = frame->len < frame_bytes ? frame->len : frame_bytes;
        memcpy(s_camera_display_buf, frame->buf, copy_len);
        if (copy_len < frame_bytes) {
            memset(s_camera_display_buf + copy_len, 0, frame_bytes - copy_len);
        }
        img_camera_dsc.data = s_camera_display_buf;
        lvgl_port_lock(0);
        if (img_camera != NULL) {
            lv_img_set_src(img_camera, &img_camera_dsc);
        }
        lvgl_port_unlock();
        esp_camera_fb_return(frame);
        vTaskDelay(pdMS_TO_TICKS(30));
    }
cleanup:
    if (camera_started) {
        esp_camera_deinit(); // 取消初始化摄像头
        vTaskDelay(pdMS_TO_TICKS(30));
    }
    dvp_pwdn(1); // 摄像头进入掉电模式
    lvgl_port_lock(0);
    if (page != NULL) {
        lv_obj_del(page); // 删除摄像头画布
    }
    if (icon_in_obj == page) {
        icon_in_obj = NULL;
    }
    if (s_camera_page == page) {
        s_camera_page = NULL;
        img_camera = NULL;
        camera_status_label = NULL;
    }
    lvgl_port_unlock();
    if (s_camera_display_buf != NULL) {
        heap_caps_free(s_camera_display_buf);
        s_camera_display_buf = NULL;
    }
    s_camera_save_requested = false;
    if (icon_flag == 4) {
        icon_flag = 0;
    }
    s_camera_running = false;
    s_camera_task_handle = NULL;
    vTaskDelete(NULL);
}

// 返回主界面按钮事件处理函数
static void btn_camback_cb(lv_event_t * e)
{
    if (icon_flag == 4) {
        camera_set_status("关闭中...");
        icon_flag = 0;
    }
}

