xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
static void btn_camera_save_cb(lv_event_t * e)
{
    s_camera_save_requested = true;
    camera_set_status("准备拍照...");
}

// 进入摄像头应用
static void camera_event_handler(lv_event_t * e)
{
    if (s_camera_running || s_camera_task_handle != NULL) {
        ESP_LOGW(TAG, "camera is still stopping");
        return;
    }

    // 创建一个界面对象
    static lv_style_t style;
    lv_style_init(&style);
    lv_style_set_radius(&style, 10);  
    lv_style_set_bg_opa( &style, LV_OPA_COVER );
    lv_style_set_bg_color(&style, lv_color_hex(0xcccccc));
    lv_style_set_border_width(&style, 0);
    lv_style_set_pad_all(&style, 0);
    lv_style_set_width(&style, 320);  
    lv_style_set_height(&style, 240); 

    icon_in_obj = lv_obj_create(lv_scr_act());
    s_camera_page = icon_in_obj;
    lv_obj_add_style(icon_in_obj, &style, 0);

    img_camera = lv_img_create(icon_in_obj);
    lv_obj_set_pos(img_camera, 0, 0);
    lv_obj_set_size(img_camera, 320, 240);

    // 创建返回按钮
    lv_obj_t *btn_back = lv_btn_create(icon_in_obj);
    lv_obj_align(btn_back, LV_ALIGN_TOP_LEFT, 0, 0);
    lv_obj_set_size(btn_back, 60, 30);
    lv_obj_set_style_border_width(btn_back, 0, 0); // 设置边框宽度
    lv_obj_set_style_pad_all(btn_back, 0, 0);  // 设置间隙
    lv_obj_set_style_bg_opa(btn_back, LV_OPA_TRANSP, LV_PART_MAIN); // 背景透明
    lv_obj_set_style_shadow_opa(btn_back, LV_OPA_TRANSP, LV_PART_MAIN); // 阴影透明
    lv_obj_add_event_cb(btn_back, btn_camback_cb, LV_EVENT_CLICKED, NULL); // 添加按键处理函数

    lv_obj_t *label_back = lv_label_create(btn_back); 
    lv_label_set_text(label_back, LV_SYMBOL_LEFT);  // 按键上显示左箭头符号
    lv_obj_set_style_text_font(label_back, &lv_font_montserrat_20, 0);
    lv_obj_set_style_text_color(label_back, lv_color_hex(0xffffff), 0); 
    lv_obj_align(label_back, LV_ALIGN_CENTER, -10, 0);

    lv_obj_t *btn_save = lv_btn_create(icon_in_obj);
    lv_obj_align(btn_save, LV_ALIGN_TOP_RIGHT, 0, 0);
    lv_obj_set_size(btn_save, 60, 30);
    lv_obj_set_style_border_width(btn_save, 0, 0);
    lv_obj_set_style_pad_all(btn_save, 0, 0);
    lv_obj_set_style_bg_opa(btn_save, LV_OPA_50, LV_PART_MAIN);
    lv_obj_set_style_shadow_opa(btn_save, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_add_event_cb(btn_save, btn_camera_save_cb, LV_EVENT_CLICKED, NULL);

    lv_obj_t *label_save = lv_label_create(btn_save);
    lv_label_set_text(label_save, LV_SYMBOL_SAVE);
    lv_obj_set_style_text_font(label_save, &lv_font_montserrat_20, 0);
    lv_obj_set_style_text_color(label_save, lv_color_hex(0xffffff), 0);
    lv_obj_center(label_save);

    camera_status_label = lv_label_create(icon_in_obj);
    lv_label_set_text(camera_status_label, "Ready");
    lv_obj_set_style_text_font(camera_status_label, &font_alipuhui20, 0);
    lv_obj_set_style_text_color(camera_status_label, lv_color_hex(0xffffff), 0);
    lv_obj_set_style_bg_color(camera_status_label, lv_color_hex(0x000000), 0);
    lv_obj_set_style_bg_opa(camera_status_label, LV_OPA_50, 0);
    lv_obj_set_style_pad_left(camera_status_label, 8, 0);
    lv_obj_set_style_pad_right(camera_status_label, 8, 0);
    lv_obj_set_style_pad_top(camera_status_label, 3, 0);
    lv_obj_set_style_pad_bottom(camera_status_label, 3, 0);
    lv_obj_align(camera_status_label, LV_ALIGN_BOTTOM_MID, 0, -6);

    icon_flag = 4; // 标记已经进入第四个应用

    s_camera_running = true;
    if (xTaskCreatePinnedToCore(task_process_camera, "task_process_camera", 4 * 1024,
                                s_camera_page, 5, &s_camera_task_handle, 1) != pdPASS) {
        s_camera_running = false;
        s_camera_task_handle = NULL;
        camera_set_status("任务创建失败");
    }
}


/******************************** 第5个图标 WiFi设置 应用程序*****************************************************************************/

lv_obj_t *wifi_scan_page;     // wifi扫描页面 obj
lv_obj_t *wifi_password_page; // wifi密码页面 obj
lv_obj_t *wifi_connect_page;  // wifi连接页面 obj
lv_obj_t *obj_scan_title;     // wifi扫描页面标题
lv_obj_t *label_wifi_scan;    // wif扫描页面 label
lv_obj_t *wifi_list;          // wifi列表  list
lv_obj_t *label_wifi_connect; // wifi连接页面label 
lv_obj_t *ta_pass_text;       // 密码输入文本框 textarea
lv_obj_t *roller_num;         // 数字roller
lv_obj_t *roller_letter_low;  // 小写字母roller
lv_obj_t *roller_letter_up;   // 大写字母roller
lv_obj_t *label_wifi_name;    // wifi名称label


#define DEFAULT_SCAN_LIST_SIZE   5                // 最大扫描wifi个数

// wifi事件组
static EventGroupHandle_t s_wifi_event_group = NULL;
// wifi事件
#define WIFI_CONNECTED_BIT    BIT0
#define WIFI_FAIL_BIT         BIT1
#define WIFI_START_BIT        BIT2
#define WIFI_GET_SNTP_BIT     BIT3
// wifi最大重连次数
#define EXAMPLE_ESP_MAXIMUM_RETRY  3

// wifi账号队列
static QueueHandle_t xQueueWifiAccount = NULL;
// 队列要传输的内容
typedef struct {
    char wifi_ssid[32];  // 获取wifi名称
    char wifi_password[64]; // 获取wifi密码  
    wifi_auth_mode_t authmode;
    char back_flag; // 是否退出       
} wifi_account_t;

#define WIFI_HISTORY_MAX 10
#define WIFI_HISTORY_PATH SD_MOUNT_POINT "/szpi/config/wlan_history.ini"
#define RANDOM_WIFI_CONFIG_PATH SD_MOUNT_POINT "/szpi/config/wifi.ini"
#define WIFI_NVS_NAMESPACE "szpi_wifi"
#define WIFI_NVS_HISTORY_KEY "history"
#define WIFI_NVS_COUNT_KEY "count"

typedef struct {
    char ssid[33];
    char password[65];
    wifi_auth_mode_t authmode;
} wifi_saved_network_t;

static wifi_saved_network_t s_wifi_history[WIFI_HISTORY_MAX];
static size_t s_wifi_history_count;
static bool s_wifi_history_loaded;
static wifi_ap_record_t s_wifi_ap_records[DEFAULT_SCAN_LIST_SIZE];
static uint16_t s_wifi_ap_count;
static bool s_wifi_handlers_registered;
static bool s_wifi_driver_started;
static int s_wifi_retry_num;

static char *wifi_trim(char *text)
{
    if (text == NULL) {
        return NULL;
    }

    while (*text != '\0' && isspace((unsigned char)*text)) {
        text++;
    }

    char *end = text + strlen(text);
    while (end > text && isspace((unsigned char)end[-1])) {
        *--end = '\0';
    }
    return text;
}

static void wifi_history_upsert(const char *ssid, const char *password, wifi_auth_mode_t authmode)
{
    if (ssid == NULL || ssid[0] == '\0') {
        return;
    }

    for (size_t i = 0; i < s_wifi_history_count; i++) {
        if (strcmp(s_wifi_history[i].ssid, ssid) == 0) {
            snprintf(s_wifi_history[i].password, sizeof(s_wifi_history[i].password), "%s", password ? password : "");
            s_wifi_history[i].authmode = authmode;
            return;
        }
    }

    if (s_wifi_history_count >= WIFI_HISTORY_MAX) {
        memmove(&s_wifi_history[0], &s_wifi_history[1], sizeof(s_wifi_history[0]) * (WIFI_HISTORY_MAX - 1));
        s_wifi_history_count = WIFI_HISTORY_MAX - 1;
    }

    snprintf(s_wifi_history[s_wifi_history_count].ssid, sizeof(s_wifi_history[s_wifi_history_count].ssid), "%s", ssid);
    snprintf(s_wifi_history[s_wifi_history_count].password, sizeof(s_wifi_history[s_wifi_history_count].password), "%s", password ? password : "");
    s_wifi_history[s_wifi_history_count].authmode = authmode;
    s_wifi_history_count++;
}

static const wifi_saved_network_t *wifi_history_find(const char *ssid)
{
    if (ssid == NULL) {
        return NULL;
    }

    for (size_t i = 0; i < s_wifi_history_count; i++) {
        if (strcmp(s_wifi_history[i].ssid, ssid) == 0) {
            return &s_wifi_history[i];
        }
    }
    return NULL;
}

