xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
esp_event_handler_instance_t instance_any_id;
esp_event_handler_instance_t instance_got_ip;
esp_netif_t *sta_netif = NULL;

static esp_err_t wifi_ensure_sta_started(void)
{
    if (s_wifi_event_group == NULL) {
        s_wifi_event_group = xEventGroupCreate();
        if (s_wifi_event_group == NULL) {
            return ESP_ERR_NO_MEM;
        }
    }

    esp_err_t ret = esp_netif_init();
    if (ret != ESP_OK && ret != ESP_ERR_INVALID_STATE) {
        return ret;
    }

    ret = esp_event_loop_create_default();
    if (ret != ESP_OK && ret != ESP_ERR_INVALID_STATE) {
        return ret;
    }

    wifi_mode_t mode;
    ret = esp_wifi_get_mode(&mode);
    bool wifi_inited = ret != ESP_ERR_WIFI_NOT_INIT;
    if (ret != ESP_OK && ret != ESP_ERR_WIFI_NOT_INIT) {
        return ret;
    }

    if (!wifi_inited) {
        if (sta_netif == NULL) {
            sta_netif = esp_netif_create_default_wifi_sta();
            if (sta_netif == NULL) {
                return ESP_FAIL;
            }
        }

        wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
        ret = esp_wifi_init(&cfg);
        if (ret != ESP_OK && ret != ESP_ERR_INVALID_STATE) {
            return ret;
        }
        (void)esp_wifi_set_storage(WIFI_STORAGE_FLASH);
    }

    if (!s_wifi_handlers_registered) {
        ret = esp_event_handler_instance_register(WIFI_EVENT,
                                                  ESP_EVENT_ANY_ID,
                                                  &event_handler,
                                                  NULL,
                                                  &instance_any_id);
        if (ret != ESP_OK && ret != ESP_ERR_INVALID_STATE) {
            return ret;
        }

        ret = esp_event_handler_instance_register(IP_EVENT,
                                                  IP_EVENT_STA_GOT_IP,
                                                  &event_handler,
                                                  NULL,
                                                  &instance_got_ip);
        if (ret != ESP_OK && ret != ESP_ERR_INVALID_STATE) {
            return ret;
        }
        s_wifi_handlers_registered = true;
    }

    ret = esp_wifi_set_mode(WIFI_MODE_STA);
    if (ret != ESP_OK) {
        return ret;
    }

    ret = esp_wifi_start();
    if (ret != ESP_OK && ret != ESP_ERR_WIFI_CONN) {
        return ret;
    }
    s_wifi_driver_started = true;
    return ESP_OK;
}

// 扫描附近wifi
static esp_err_t wifi_scan(wifi_ap_record_t ap_info[], uint16_t *ap_number)
{
    uint16_t ap_count = 0;
    esp_err_t ret = wifi_ensure_sta_started();
    if (ret != ESP_OK) {
        return ret;
    }

    memset(ap_info, 0, *ap_number * sizeof(wifi_ap_record_t));

    ret = esp_wifi_scan_start(NULL, true);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "wifi scan failed: %s", esp_err_to_name(ret));
        return ret;
    }

    ESP_LOGI(TAG, "Max AP number ap_info can hold = %u", *ap_number);
    ESP_RETURN_ON_ERROR(esp_wifi_scan_get_ap_num(&ap_count), TAG, "get AP num failed");  // 获取扫描到的wifi数量
    ESP_RETURN_ON_ERROR(esp_wifi_scan_get_ap_records(ap_number, ap_info), TAG, "get AP records failed"); // 获取真实的获取到wifi数量和信息
    ESP_LOGI(TAG, "Total APs scanned = %u, actual AP number ap_info holds = %u", ap_count, *ap_number);
    return ESP_OK;
}

// 清除wifi初始化内容
static void wifiset_deinit(void)
{
    // WiFi may be shared with random image and time sync. Keep the driver alive.
}

// WIFI连接任务
static void wifi_connect(void *arg)
{
    wifi_account_t wifi_account;

    while (true)
    {
        // 如果收到wifi账号队列消息
        if(xQueueReceive(xQueueWifiAccount, &wifi_account, portMAX_DELAY))
        {
            if (wifi_account.back_flag == 1){  // 退出任务标志
                if (xQueueWifiAccount != NULL) {
                    vQueueDelete(xQueueWifiAccount);
                    xQueueWifiAccount = NULL;
                }
                break; // 跳出while循环
            }
            
            wifi_config_t wifi_config = {
                .sta = {
                    .sae_pwe_h2e = WPA3_SAE_PWE_BOTH,
                    .sae_h2e_identifier = "",
                    },
            };
            snprintf((char *)wifi_config.sta.ssid, sizeof(wifi_config.sta.ssid), "%s", wifi_account.wifi_ssid);
            snprintf((char *)wifi_config.sta.password, sizeof(wifi_config.sta.password), "%s", wifi_account.wifi_password);
            wifi_config.sta.threshold.authmode = wifi_account.wifi_password[0] == '\0' ? WIFI_AUTH_OPEN : WIFI_AUTH_WPA_PSK;

            esp_err_t ret = wifi_ensure_sta_started();
            if (ret != ESP_OK) {
                ESP_LOGE(TAG, "wifi start failed: %s", esp_err_to_name(ret));
                if (label_wifi_connect != NULL) {
                    lvgl_port_lock(0);
                    lv_label_set_text(label_wifi_connect, "WLAN 启动失败");
                    lvgl_port_unlock();
                }
                vTaskDelay(pdMS_TO_TICKS(1000));
                if (wifi_connect_page != NULL) {
                    lvgl_port_lock(0);
                    lv_obj_del(wifi_connect_page);
                    wifi_connect_page = NULL;
                    lvgl_port_unlock();
                }
                continue;
            }

            xEventGroupClearBits(s_wifi_event_group, WIFI_CONNECTED_BIT | WIFI_FAIL_BIT);
            s_wifi_retry_num = 0;
            ret = esp_wifi_set_config(WIFI_IF_STA, &wifi_config);
            if (ret != ESP_OK) {
                ESP_LOGE(TAG, "wifi config failed: %s", esp_err_to_name(ret));
                if (label_wifi_connect != NULL) {
                    lvgl_port_lock(0);
                    lv_label_set_text(label_wifi_connect, "WLAN 配置失败");
                    lvgl_port_unlock();
                }
                vTaskDelay(pdMS_TO_TICKS(1000));
                if (wifi_connect_page != NULL) {
                    lvgl_port_lock(0);
                    lv_obj_del(wifi_connect_page);
                    wifi_connect_page = NULL;
                    lvgl_port_unlock();
                }
                continue;
            }
            esp_wifi_disconnect();
            esp_wifi_connect();
            /* Waiting until either the connection is established (WIFI_CONNECTED_BIT) or connection failed for the maximum
            * number of re-tries (WIFI_FAIL_BIT). The bits are set by event_handler() (see above) */
            EventBits_t bits = xEventGroupWaitBits(s_wifi_event_group,
            WIFI_CONNECTED_BIT | WIFI_FAIL_BIT,
            pdFALSE,
            pdFALSE,
            pdMS_TO_TICKS(20000));

            /* xEventGroupWaitBits() returns the bits before the call returned, hence we can test which event actually
            * happened. */
            if (bits & WIFI_CONNECTED_BIT) {
                ESP_LOGI(TAG, "connected to ap SSID:%s password:%s", wifi_config.sta.ssid, wifi_config.sta.password);
                wifi_history_upsert(wifi_account.wifi_ssid, wifi_account.wifi_password, wifi_account.authmode);
                wifi_history_save_all();
                wifi_save_random_image_config(wifi_account.wifi_ssid, wifi_account.wifi_password);
                lvgl_port_lock(0);
                lv_label_set_text(label_wifi_connect, "WLAN 连接成功");
                lvgl_port_unlock();
                vTaskDelay(1000 / portTICK_PERIOD_MS); // 给上面的显示一点时间
                lvgl_port_lock(0);
                lv_obj_del(wifi_connect_page); // 删除此页面
                wifi_connect_page = NULL;
                lv_obj_del(wifi_scan_page); // 删除此页面
                wifi_scan_page = NULL;
                lvgl_port_unlock();
                vQueueDelete(xQueueWifiAccount); // 删除队列
                xQueueWifiAccount = NULL;
                icon_flag = 0; // 标记回到主界面
                xTaskCreatePinnedToCore(get_time_task, "get_time_task", 2 * 1024, NULL, 5, NULL, 0);  // 创建获取时间任务
                break; // 跳出while循环删除任务
            } else if (bits & WIFI_FAIL_BIT) {
                ESP_LOGI(TAG, "Failed to connect to SSID:%s, password:%s", wifi_config.sta.ssid, wifi_config.sta.password);
                lvgl_port_lock(0);
                lv_label_set_text(label_wifi_connect, "WLAN 连接失败");
                lvgl_port_unlock();
                vTaskDelay(1000 / portTICK_PERIOD_MS); // 给上面的显示一点时间
                lvgl_port_lock(0);
                lv_obj_del(wifi_connect_page); // 删除此页面
                wifi_connect_page = NULL;
                lvgl_port_unlock();
                xEventGroupClearBits(s_wifi_event_group, WIFI_FAIL_BIT); // 清除此事件标志位

            } else {
                ESP_LOGE(TAG, "UNEXPECTED EVENT");
                lvgl_port_lock(0);
                lv_label_set_text(label_wifi_connect, "WLAN 连接异常");
                lvgl_port_unlock();
                vTaskDelay(1000 / portTICK_PERIOD_MS); // 给上面的显示一点时间
                lvgl_port_lock(0);
                lv_obj_del(wifi_connect_page); // 删除此页面
                wifi_connect_page = NULL;
                lv_obj_del(wifi_scan_page); // 删除此页面
                wifi_scan_page = NULL;
                lvgl_port_unlock();
            }
        }
    }
    vTaskDelete(NULL);
}

// 返回主界面按钮事件处理函数
static void btn_backmain_cb(lv_event_t * e)
{
    ESP_LOGI(TAG, "btn_backmain Clicked");

