xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
    lv_obj_t *label_back = lv_label_create(btn_ble_back); 
    lv_label_set_text(label_back, LV_SYMBOL_LEFT);  // 按键上显示左箭头符号
    lv_obj_set_style_text_font(label_back, &lv_font_montserrat_20, 0);
    lv_obj_set_style_text_color(label_back, lv_color_hex(0xffffff), 0); 
    lv_obj_align(label_back, LV_ALIGN_CENTER, -10, 0);

    esp_err_t ret = app_hid_ctrl();
    if (ret == ESP_OK) {
        lv_label_set_text(ble_label, "BLE HID Ready");
    } else {
        lv_label_set_text_fmt(ble_label, "BLE失败:%s", esp_err_to_name(ret));
    }

    icon_flag = 6; // 标记已经进入第6个应用
}


/******************************** 录音机 应用程序 *****************************************************************************/
#define RECORDER_SAMPLE_RATE       16000
#define RECORDER_CHANNELS          1
#define RECORDER_BITS_PER_SAMPLE   16
#define RECORDER_SRC_CHANNELS      ADC_I2S_CHANNEL
#define RECORDER_FRAMES_PER_CHUNK  512
#define RECORDER_ICON_FLAG         8

static lv_obj_t *s_recorder_status_label;
static lv_obj_t *s_recorder_time_label;
static lv_obj_t *s_recorder_file_label;
static lv_obj_t *s_recorder_level_bar;
static lv_obj_t *s_recorder_button_label;
static TaskHandle_t s_recorder_task_handle;
static volatile bool s_recorder_active;
static volatile bool s_recorder_exit_requested;

static void recorder_write_le16(FILE *f, uint16_t value)
{
    uint8_t b[2] = {
        (uint8_t)(value & 0xff),
        (uint8_t)((value >> 8) & 0xff),
    };
    fwrite(b, 1, sizeof(b), f);
}

static void recorder_write_le32(FILE *f, uint32_t value)
{
    uint8_t b[4] = {
        (uint8_t)(value & 0xff),
        (uint8_t)((value >> 8) & 0xff),
        (uint8_t)((value >> 16) & 0xff),
        (uint8_t)((value >> 24) & 0xff),
    };
    fwrite(b, 1, sizeof(b), f);
}

static void recorder_write_wav_header(FILE *f, uint32_t data_bytes)
{
    uint32_t byte_rate = RECORDER_SAMPLE_RATE * RECORDER_CHANNELS * RECORDER_BITS_PER_SAMPLE / 8;
    uint16_t block_align = RECORDER_CHANNELS * RECORDER_BITS_PER_SAMPLE / 8;

    fwrite("RIFF", 1, 4, f);
    recorder_write_le32(f, 36 + data_bytes);
    fwrite("WAVE", 1, 4, f);
    fwrite("fmt ", 1, 4, f);
    recorder_write_le32(f, 16);
    recorder_write_le16(f, 1);
    recorder_write_le16(f, RECORDER_CHANNELS);
    recorder_write_le32(f, RECORDER_SAMPLE_RATE);
    recorder_write_le32(f, byte_rate);
    recorder_write_le16(f, block_align);
    recorder_write_le16(f, RECORDER_BITS_PER_SAMPLE);
    fwrite("data", 1, 4, f);
    recorder_write_le32(f, data_bytes);
}

static void recorder_set_label_text(lv_obj_t *label, const char *text)
{
    if (label == NULL) {
        return;
    }
    lvgl_port_lock(0);
    if (label != NULL) {
        lv_label_set_text(label, text);
    }
    lvgl_port_unlock();
}

static void recorder_update_ui(uint32_t samples_written, int peak)
{
    uint32_t seconds = samples_written / RECORDER_SAMPLE_RATE;
    char time_text[24];
    snprintf(time_text, sizeof(time_text), "%02lu:%02lu", (unsigned long)(seconds / 60), (unsigned long)(seconds % 60));

    lvgl_port_lock(0);
    if (s_recorder_time_label != NULL) {
        lv_label_set_text(s_recorder_time_label, time_text);
    }
    if (s_recorder_level_bar != NULL) {
        int value = peak * 100 / 32767;
        if (value > 100) {
            value = 100;
        }
        lv_bar_set_value(s_recorder_level_bar, value, LV_ANIM_OFF);
    }
    lvgl_port_unlock();
}

static void recorder_set_button_text(const char *text)
{
    recorder_set_label_text(s_recorder_button_label, text);
}

static void recorder_stop_and_exit_ui(void)
{
    lvgl_port_lock(0);
    if (icon_in_obj != NULL) {
        lv_obj_del(icon_in_obj);
        icon_in_obj = NULL;
    }
    lvgl_port_unlock();
    s_recorder_status_label = NULL;
    s_recorder_time_label = NULL;
    s_recorder_file_label = NULL;
    s_recorder_level_bar = NULL;
    s_recorder_button_label = NULL;
    icon_flag = 0;
}

static void recorder_task(void *arg)
{
    int16_t *raw = heap_caps_malloc(RECORDER_FRAMES_PER_CHUNK * RECORDER_SRC_CHANNELS * sizeof(int16_t), MALLOC_CAP_8BIT | MALLOC_CAP_INTERNAL);
    int16_t *mono = heap_caps_malloc(RECORDER_FRAMES_PER_CHUNK * sizeof(int16_t), MALLOC_CAP_8BIT | MALLOC_CAP_INTERNAL);
    FILE *f = NULL;
    uint32_t data_bytes = 0;
    uint32_t samples_written = 0;
    char path[128];
    esp_err_t ret = ESP_OK;

    if (raw == NULL || mono == NULL) {
        recorder_set_label_text(s_recorder_status_label, "录音缓冲不足");
        goto done;
    }

    if (g_audio_player_ready) {
        audio_player_stop();
    }

    ret = bsp_sdcard_mount();
    if (ret != ESP_OK) {
        recorder_set_label_text(s_recorder_status_label, "TF卡不可用");
        goto done;
    }

    mkdir(SD_MOUNT_POINT "/szpi", 0775);
    mkdir(SD_MOUNT_POINT "/szpi/recordings", 0775);
    snprintf(path, sizeof(path), SD_MOUNT_POINT "/szpi/recordings/rec_%lld.wav", esp_timer_get_time() / 1000);

    f = fopen(path, "wb+");
    if (f == NULL) {
        recorder_set_label_text(s_recorder_status_label, "创建文件失败");
        goto done;
    }

    recorder_write_wav_header(f, 0);
    recorder_set_label_text(s_recorder_status_label, "录音中...");
    recorder_set_label_text(s_recorder_file_label, path);
    recorder_set_button_text("停止");

    while (s_recorder_active && icon_flag == RECORDER_ICON_FLAG) {
        ret = bsp_get_feed_data(true, raw, RECORDER_FRAMES_PER_CHUNK * RECORDER_SRC_CHANNELS * sizeof(int16_t));
        if (ret != ESP_OK) {
            recorder_set_label_text(s_recorder_status_label, "麦克风读取失败");
            break;
        }

        int peak = 0;
        for (int i = 0; i < RECORDER_FRAMES_PER_CHUNK; i++) {
            int16_t sample = raw[i * RECORDER_SRC_CHANNELS + 1];
            mono[i] = sample;
            int abs_sample = sample == INT16_MIN ? 32767 : abs(sample);
            if (abs_sample > peak) {
                peak = abs_sample;
            }
        }

        size_t written = fwrite(mono, sizeof(int16_t), RECORDER_FRAMES_PER_CHUNK, f);
        if (written != RECORDER_FRAMES_PER_CHUNK) {
            recorder_set_label_text(s_recorder_status_label, "写入失败");
            break;
        }

        data_bytes += RECORDER_FRAMES_PER_CHUNK * sizeof(int16_t);
        samples_written += RECORDER_FRAMES_PER_CHUNK;
        recorder_update_ui(samples_written, peak);
    }

    if (f != NULL) {
        fflush(f);
        fseek(f, 0, SEEK_SET);
        recorder_write_wav_header(f, data_bytes);
        fclose(f);
        f = NULL;
    }

    if (data_bytes > 0) {
        recorder_set_label_text(s_recorder_status_label, "已保存");
        recorder_set_label_text(s_recorder_file_label, path);
    }

done:
    if (f != NULL) {
        fclose(f);
    }
    if (raw != NULL) {
        heap_caps_free(raw);
    }
    if (mono != NULL) {
        heap_caps_free(mono);
    }
    s_recorder_active = false;
    s_recorder_task_handle = NULL;
    recorder_set_button_text("开始");
    if (s_recorder_exit_requested) {
        s_recorder_exit_requested = false;
        recorder_stop_and_exit_ui();
    }
    vTaskDelete(NULL);
}

static void recorder_toggle_cb(lv_event_t *e)
{
    if (lv_event_get_code(e) != LV_EVENT_CLICKED) {
        return;
    }

