xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
    if (s_recorder_active) {
        s_recorder_active = false;
        recorder_set_label_text(s_recorder_status_label, "停止中...");
        return;
    }

    if (s_recorder_task_handle != NULL) {
        return;
    }

    s_recorder_exit_requested = false;
    s_recorder_active = true;
    recorder_update_ui(0, 0);
    recorder_set_label_text(s_recorder_file_label, "");
    BaseType_t ok = xTaskCreatePinnedToCore(recorder_task, "recorder", 5 * 1024, NULL, 5, &s_recorder_task_handle, 1);
    if (ok != pdPASS) {
        s_recorder_active = false;
        s_recorder_task_handle = NULL;
        recorder_set_label_text(s_recorder_status_label, "启动失败");
    }
}

static void recorder_back_cb(lv_event_t *e)
{
    if (lv_event_get_code(e) != LV_EVENT_CLICKED) {
        return;
    }

    if (s_recorder_active) {
        s_recorder_exit_requested = true;
        s_recorder_active = false;
        recorder_set_label_text(s_recorder_status_label, "停止中...");
        return;
    }

    recorder_stop_and_exit_ui();
}

static void recorder_event_handler(lv_event_t *e)
{
    static lv_style_t style;
    lv_style_init(&style);
    lv_style_set_radius(&style, 10);
    lv_style_set_bg_opa(&style, LV_OPA_COVER);
    lv_style_set_bg_color(&style, lv_color_hex(0xffffff));
    lv_style_set_border_width(&style, 0);
    lv_style_set_pad_all(&style, 0);
    lv_style_set_width(&style, 320);
    lv_style_set_height(&style, 240);

    icon_in_obj = lv_obj_create(lv_scr_act());
    lv_obj_add_style(icon_in_obj, &style, 0);

    lv_obj_t *title = lv_obj_create(icon_in_obj);
    lv_obj_set_size(title, 320, 40);
    lv_obj_set_style_pad_all(title, 0, 0);
    lv_obj_align(title, LV_ALIGN_TOP_LEFT, 0, 0);
    lv_obj_set_style_bg_color(title, lv_color_hex(0x2c8dbf), 0);

    lv_obj_t *title_label = lv_label_create(title);
    lv_label_set_text(title_label, "录音机");
    lv_obj_set_style_text_color(title_label, lv_color_hex(0xffffff), 0);
    lv_obj_set_style_text_font(title_label, &font_alipuhui20, 0);
    lv_obj_align(title_label, LV_ALIGN_CENTER, 0, 0);

    lv_obj_t *btn_back = lv_btn_create(title);
    lv_obj_align(btn_back, LV_ALIGN_LEFT_MID, 0, 0);
    lv_obj_set_size(btn_back, 60, 30);
    lv_obj_set_style_border_width(btn_back, 0, 0);
    lv_obj_set_style_pad_all(btn_back, 0, 0);
    lv_obj_set_style_bg_opa(btn_back, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_shadow_opa(btn_back, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_add_event_cb(btn_back, recorder_back_cb, LV_EVENT_CLICKED, NULL);

    lv_obj_t *label_back = lv_label_create(btn_back);
    lv_label_set_text(label_back, LV_SYMBOL_LEFT);
    lv_obj_set_style_text_font(label_back, &lv_font_montserrat_20, 0);
    lv_obj_set_style_text_color(label_back, lv_color_hex(0xffffff), 0);
    lv_obj_align(label_back, LV_ALIGN_CENTER, -10, 0);

    s_recorder_time_label = lv_label_create(icon_in_obj);
    lv_label_set_text(s_recorder_time_label, "00:00");
    lv_obj_set_style_text_font(s_recorder_time_label, &lv_font_montserrat_24, 0);
    lv_obj_set_style_text_color(s_recorder_time_label, lv_color_hex(0x1f2933), 0);
    lv_obj_align(s_recorder_time_label, LV_ALIGN_TOP_MID, 0, 62);

    s_recorder_status_label = lv_label_create(icon_in_obj);
    lv_label_set_text(s_recorder_status_label, "Ready");
    lv_obj_set_style_text_font(s_recorder_status_label, &font_alipuhui20, 0);
    lv_obj_set_style_text_color(s_recorder_status_label, lv_color_hex(0x3b4856), 0);
    lv_obj_align(s_recorder_status_label, LV_ALIGN_TOP_MID, 0, 98);

    s_recorder_level_bar = lv_bar_create(icon_in_obj);
    lv_obj_set_size(s_recorder_level_bar, 220, 12);
    lv_bar_set_range(s_recorder_level_bar, 0, 100);
    lv_bar_set_value(s_recorder_level_bar, 0, LV_ANIM_OFF);
    lv_obj_align(s_recorder_level_bar, LV_ALIGN_TOP_MID, 0, 128);

    lv_obj_t *btn_record = lv_btn_create(icon_in_obj);
    lv_obj_set_size(btn_record, 118, 46);
    lv_obj_align(btn_record, LV_ALIGN_TOP_MID, 0, 154);
    lv_obj_set_style_bg_color(btn_record, lv_color_hex(0xd64b4b), 0);
    lv_obj_set_style_radius(btn_record, 8, 0);
    lv_obj_add_event_cb(btn_record, recorder_toggle_cb, LV_EVENT_CLICKED, NULL);

    s_recorder_button_label = lv_label_create(btn_record);
    lv_label_set_text(s_recorder_button_label, "开始");
    lv_obj_set_style_text_font(s_recorder_button_label, &font_alipuhui20, 0);
    lv_obj_set_style_text_color(s_recorder_button_label, lv_color_hex(0xffffff), 0);
    lv_obj_center(s_recorder_button_label);

    s_recorder_file_label = lv_label_create(icon_in_obj);
    lv_label_set_text(s_recorder_file_label, "");
    lv_label_set_long_mode(s_recorder_file_label, LV_LABEL_LONG_SCROLL_CIRCULAR);
    lv_obj_set_width(s_recorder_file_label, 290);
    lv_obj_set_style_text_font(s_recorder_file_label, &lv_font_montserrat_14, 0);
    lv_obj_set_style_text_color(s_recorder_file_label, lv_color_hex(0x627181), 0);
    lv_obj_align(s_recorder_file_label, LV_ALIGN_BOTTOM_MID, 0, -12);

    s_recorder_active = false;
    s_recorder_exit_requested = false;
    icon_flag = RECORDER_ICON_FLAG;
}


/******************************** 主界面  ******************************/

LV_IMG_DECLARE(img_att_icon);
LV_IMG_DECLARE(img_music_icon);
LV_IMG_DECLARE(img_sd_icon);
LV_IMG_DECLARE(img_camera_icon);
LV_IMG_DECLARE(img_wifiset_icon);
LV_IMG_DECLARE(img_btset_icon);

#define HOME_ITEMS_PER_PAGE 4
#define HOME_SWIPE_THRESHOLD 36
#define HOME_SWIPE_AXIS_MARGIN 10
#define HOME_SWIPE_CLICK_SUPPRESS_MS 450

typedef enum {
    HOME_ICON_SYMBOL,
    HOME_ICON_IMAGE,
} home_icon_type_t;

typedef struct {
    const char *title;
    const char *subtitle;
    uint32_t color_hex;
    home_icon_type_t icon_type;
    const void *icon_src;
    void (*event_cb)(lv_event_t *e);
} home_app_item_t;

static lv_obj_t *s_home_icon_layer;
static lv_obj_t *s_home_page_label;
static uint8_t s_home_page_index;
static bool s_home_styles_ready;
static bool s_home_launch_locked;
static bool s_home_button_task_started;
static bool s_home_press_tracking;
static bool s_home_swipe_consumed;
static bool s_home_swipe_suppress_click;
static lv_point_t s_home_press_point;
static lv_timer_t *s_home_swipe_clear_timer;
static lv_style_t s_home_bg_style;
static lv_style_t s_home_button_style;
static lv_style_t s_home_button_pressed_style;

static const home_app_item_t s_home_apps[] = {
    { "随机图", "API",    0x2fa66a, HOME_ICON_SYMBOL, LV_SYMBOL_IMAGE,   random_image_app_event_handler },
    { "姿态",   "QMI8658", 0xf06d2f, HOME_ICON_IMAGE,  &img_att_icon,     att_event_handler },
    { "音乐",   "Player", 0x4c7bd9, HOME_ICON_IMAGE,  &img_music_icon,   music_event_handler },
    { "TF卡",   "Files",  0x009688, HOME_ICON_IMAGE,  &img_sd_icon,      sdcard_event_handler },
    { "TF管理", "Disk",   0x176b78, HOME_ICON_IMAGE,  &img_sd_icon,      sdmgr_event_handler },
    { "录音",   "WAV",    0x2c8dbf, HOME_ICON_SYMBOL, LV_SYMBOL_AUDIO,   recorder_event_handler },
    { "摄像头", "Camera", 0xd8a318, HOME_ICON_IMAGE,  &img_camera_icon,  camera_event_handler },
    { "WLAN",   "Scan",   0xc85a5a, HOME_ICON_IMAGE,  &img_wifiset_icon, wifiset_event_handler },
    { "蓝牙",   "HID",    0xa36bb8, HOME_ICON_IMAGE,  &img_btset_icon,   btset_event_handler },
};

static uint8_t home_page_count(void)
{
    return (sizeof(s_home_apps) / sizeof(s_home_apps[0]) + HOME_ITEMS_PER_PAGE - 1) / HOME_ITEMS_PER_PAGE;
}

static void home_styles_init(void)
{
    if (s_home_styles_ready) {
        return;
    }

    lv_style_init(&s_home_bg_style);
    lv_style_set_radius(&s_home_bg_style, 0);
    lv_style_set_bg_opa(&s_home_bg_style, LV_OPA_COVER);
    lv_style_set_bg_color(&s_home_bg_style, lv_color_hex(0x111820));
    lv_style_set_bg_grad_color(&s_home_bg_style, lv_color_hex(0x24313a));
    lv_style_set_bg_grad_dir(&s_home_bg_style, LV_GRAD_DIR_VER);
    lv_style_set_border_width(&s_home_bg_style, 0);
    lv_style_set_pad_all(&s_home_bg_style, 0);
    lv_style_set_width(&s_home_bg_style, 320);
    lv_style_set_height(&s_home_bg_style, 240);

    lv_style_init(&s_home_button_style);
    lv_style_set_radius(&s_home_button_style, 10);
    lv_style_set_bg_opa(&s_home_button_style, LV_OPA_COVER);
    lv_style_set_border_width(&s_home_button_style, 0);
    lv_style_set_shadow_width(&s_home_button_style, 0);
    lv_style_set_pad_all(&s_home_button_style, 0);
    lv_style_set_text_color(&s_home_button_style, lv_color_hex(0xffffff));

    lv_style_init(&s_home_button_pressed_style);
    lv_style_set_bg_opa(&s_home_button_pressed_style, LV_OPA_80);

    s_home_styles_ready = true;
}

static void home_render_page(void);

static void home_clear_swipe_suppress_cb(lv_timer_t *timer)
{
    s_home_swipe_suppress_click = false;
    s_home_swipe_clear_timer = NULL;
    lv_timer_del(timer);
}

static void home_defer_clear_swipe_suppress(void)
{
    if (s_home_swipe_clear_timer != NULL) {
        lv_timer_reset(s_home_swipe_clear_timer);
        return;
    }

    s_home_swipe_clear_timer = lv_timer_create(home_clear_swipe_suppress_cb,
                                               HOME_SWIPE_CLICK_SUPPRESS_MS, NULL);
    if (s_home_swipe_clear_timer != NULL) {
        lv_timer_set_repeat_count(s_home_swipe_clear_timer, 1);
    } else {
        s_home_swipe_suppress_click = false;
    }
}

static void home_unlock_launch_cb(lv_timer_t *timer)
{
    s_home_launch_locked = false;
    lv_timer_del(timer);
}

static void home_app_clicked_cb(lv_event_t *e)
{
    if (lv_event_get_code(e) != LV_EVENT_CLICKED) {
        return;
    }
    if (s_home_launch_locked || s_home_swipe_suppress_click || icon_flag != 0) {
        return;
    }

