xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
    const home_app_item_t *app = (const home_app_item_t *)lv_event_get_user_data(e);
    if (app == NULL || app->event_cb == NULL) {
        return;
    }

    s_home_launch_locked = true;
    lv_timer_t *unlock_timer = lv_timer_create(home_unlock_launch_cb, 1200, NULL);
    lv_timer_set_repeat_count(unlock_timer, 1);
    app->event_cb(e);
}

static void home_switch_page(int delta)
{
    int page_count = (int)home_page_count();
    if (page_count <= 1) {
        return;
    }

    int next = ((int)s_home_page_index + delta) % page_count;
    if (next < 0) {
        next += page_count;
    }

    if (next == s_home_page_index) {
        return;
    }

    s_home_page_index = (uint8_t)next;
    home_render_page();
}

static void home_switch_page_async_cb(void *arg)
{
    home_switch_page((int)(intptr_t)arg);
}

static void home_request_page_switch(int delta)
{
    lv_async_call(home_switch_page_async_cb, (void *)(intptr_t)delta);
}

static void home_button_next_page_cb(void *arg)
{
    if (icon_flag == 0 && s_home_icon_layer != NULL) {
        home_switch_page(1);
    }
}

static void home_button_task(void *arg)
{
    gpio_num_t key_gpio = CONFIG_RANDOM_IMAGE_REFRESH_GPIO;
    gpio_config_t io_conf = {
        .pin_bit_mask = 1ULL << key_gpio,
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = GPIO_PULLUP_ENABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&io_conf);

    int last_level = 1;
    int64_t press_start_us = 0;

    while (true) {
        int level = gpio_get_level(key_gpio);
        int64_t now_us = esp_timer_get_time();
        if (last_level == 1 && level == 0) {
            press_start_us = now_us;
        } else if (last_level == 0 && level == 1 && press_start_us > 0) {
            int64_t held_us = now_us - press_start_us;
            if (held_us > 30000 && held_us < 2000000 && icon_flag == 0) {
                lv_async_call(home_button_next_page_cb, NULL);
            }
            press_start_us = 0;
        }
        last_level = level;
        vTaskDelay(pdMS_TO_TICKS(20));
    }
}

static void home_ensure_button_task(void)
{
    if (s_home_button_task_started) {
        return;
    }

    BaseType_t ok = xTaskCreatePinnedToCore(home_button_task, "home_button", 4 * 1024, NULL, 4, NULL, 1);
    if (ok == pdPASS) {
        s_home_button_task_started = true;
    } else {
        ESP_LOGE(TAG, "create home_button task failed");
    }
}

static void home_gesture_cb(lv_event_t *e)
{
    if (lv_event_get_code(e) != LV_EVENT_GESTURE) {
        return;
    }

    lv_indev_t *indev = lv_indev_get_act();
    if (indev == NULL) {
        return;
    }

    lv_dir_t dir = lv_indev_get_gesture_dir(indev);
    if (dir == LV_DIR_LEFT) {
        s_home_swipe_suppress_click = true;
        home_request_page_switch(1);
        home_defer_clear_swipe_suppress();
    } else if (dir == LV_DIR_RIGHT) {
        s_home_swipe_suppress_click = true;
        home_request_page_switch(-1);
        home_defer_clear_swipe_suppress();
    }
}

static void home_pointer_cb(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    lv_indev_t *indev = lv_indev_get_act();
    if (indev == NULL) {
        return;
    }

    if (code == LV_EVENT_PRESSED) {
        if (icon_flag != 0) {
            return;
        }
        lv_indev_get_point(indev, &s_home_press_point);
        s_home_press_tracking = true;
        s_home_swipe_consumed = false;
        return;
    }

    if (code == LV_EVENT_PRESSING) {
        if (!s_home_press_tracking || s_home_swipe_consumed || icon_flag != 0) {
            return;
        }

        lv_point_t point;
        lv_indev_get_point(indev, &point);
        int dx = point.x - s_home_press_point.x;
        int dy = point.y - s_home_press_point.y;
        int abs_dx = abs(dx);
        int abs_dy = abs(dy);
        if (abs_dx >= HOME_SWIPE_THRESHOLD && abs_dx > abs_dy + HOME_SWIPE_AXIS_MARGIN) {
            s_home_swipe_consumed = true;
            s_home_press_tracking = false;
            s_home_swipe_suppress_click = true;
            home_request_page_switch(dx < 0 ? 1 : -1);
            home_defer_clear_swipe_suppress();
        }
        return;
    }

    if (code == LV_EVENT_RELEASED || code == LV_EVENT_PRESS_LOST) {
        s_home_press_tracking = false;
        s_home_swipe_consumed = false;
    }
}

static void home_create_icon(const home_app_item_t *app, uint8_t slot)
{
    static const lv_coord_t x_pos[2] = { 8, 164 };
    static const lv_coord_t y_pos[2] = { 50, 136 };
    uint8_t col = slot % 2;
    uint8_t row = slot / 2;

    lv_obj_t *btn = lv_btn_create(s_home_icon_layer);
    lv_obj_add_style(btn, &s_home_button_style, 0);
    lv_obj_add_style(btn, &s_home_button_pressed_style, LV_STATE_PRESSED);
    lv_obj_set_style_bg_color(btn, lv_color_hex(app->color_hex), 0);
    lv_obj_set_size(btn, 148, 76);
    lv_obj_set_pos(btn, x_pos[col], y_pos[row] - 45);
    lv_obj_clear_flag(btn, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_add_flag(btn, LV_OBJ_FLAG_GESTURE_BUBBLE);
    lv_obj_add_event_cb(btn, home_pointer_cb, LV_EVENT_PRESSED, NULL);
    lv_obj_add_event_cb(btn, home_pointer_cb, LV_EVENT_PRESSING, NULL);
    lv_obj_add_event_cb(btn, home_pointer_cb, LV_EVENT_RELEASED, NULL);
    lv_obj_add_event_cb(btn, home_pointer_cb, LV_EVENT_PRESS_LOST, NULL);
    lv_obj_add_event_cb(btn, home_app_clicked_cb, LV_EVENT_CLICKED, (void *)app);
    lv_obj_add_event_cb(btn, home_gesture_cb, LV_EVENT_GESTURE, NULL);

    if (app->icon_type == HOME_ICON_IMAGE) {
        lv_obj_t *img = lv_img_create(btn);
        lv_img_set_src(img, app->icon_src);
        lv_img_set_zoom(img, 192);
        lv_obj_align(img, LV_ALIGN_LEFT_MID, 7, 0);
    } else {
        lv_obj_t *symbol = lv_label_create(btn);
        lv_label_set_text(symbol, (const char *)app->icon_src);
        lv_obj_set_style_text_font(symbol, &lv_font_montserrat_24, 0);
        lv_obj_set_style_text_color(symbol, lv_color_hex(0xffffff), 0);
        lv_obj_align(symbol, LV_ALIGN_LEFT_MID, 24, 0);
    }

    lv_obj_t *title = lv_label_create(btn);
    lv_label_set_text(title, app->title);
    lv_obj_set_style_text_font(title, &font_alipuhui20, 0);
    lv_obj_set_style_text_color(title, lv_color_hex(0xffffff), 0);
    lv_obj_set_width(title, 68);
    lv_obj_align(title, LV_ALIGN_LEFT_MID, 76, -12);

